import React from 'react';
import Simpson from "../simpson/Simpson";

import '../simpson/style.css'

const Simpsons = () => {
    return (
        <div className='container'>
            <h1>Simpsons Биография</h1>
            <Simpson
            heroName={'Гомер Симпсон'}
            biography={'Гомер Джей Симпсон старший (англ. Homer Jay Simpson, Sr.) (род. 10 мая 1950 cудя по разным ' +
                'сериям) – один из главных героев сериала. Глава семьи имеет избыточный вес, ленив, туповат, но при' +
                ' всех недостатках показан преданным и любящим отцом и мужем (особенно в первых сезонах).'}
            image={'https://static.wikia.nocookie.net/simpsons/images/0/02/Homer_Simpson_2006.png'}

            />

            <Simpson
                heroName={'Барт Симпсон'}
                biography={'Бартоломью "Барт" ДжоДжо/Джей Симпсон (1 апреля 1979) (запланированное имя – Морт Симпсон) ' +
                    '(англ. Bart Simspon) – озорной и "особо опасный" сын Гомера и Мардж Симпсон, является старшим ' +
                    'братом Лизы и Мэгги. Так же Барт известен как "Эль Барто" и "Бартмен". После обнаружения кометы в ' +
                    'эпизоде "Комета Барта" получил прозвище Космо. Целая серия комиксов с одноименным названием ' +
                    '(ранее англ. Simpsons Comics Presents Bart Simpson) посвящены Барту. Барт создан по подобию юного ' +
                    'Мэтта Грейнинга и его брата Марка.'}
                image={'https://static.wikia.nocookie.net/simpsons/images/1/14/Bartsimpson2.png'}

            />

            <Simpson
                heroName={'Мардж Симпсон'}
                biography={'Это человек практически идеальный: у него примерная семья, у него есть всё, что ' +
                    'соответствует американской мечте среднего класса, он не имеет проблем с законом, вредных ' +
                    'привычек, имеет спортивное тело (что не заметно через одежду), находится в хороших отношениях' +
                    ' с практически всем городом, участвует в различной социальной и волонтерской деятельности.' +
                    ' Однако Нед до комичности религиозен, что доводит его правильность до фарса. '}
                image={'https://static.wikia.nocookie.net/simpsons/images/0/0b/Marge_Simpson.png'}

            />

            <Simpson
                heroName={'Лиза Симпсон'}
                biography={'Очень любит играть на своём саксофоне. Также неплохо поёт. Её кумиром был Мёрфи Кровавые Дёсны, ' +
                    'с которым она лично познакомилась в первом сезоне. Но знакомство оказалось недолгим — вскоре Мёрфи' +
                    ' умер, оставшись её вдохновителем. Любимая песня: «The Broken Neck Blues». Любимый альбом: ' +
                    '«Birth of the Cool» Майлза Дэвиса.'}
                image={'https://static.wikia.nocookie.net/simpsons/images/5/57/Lisa_Simpson2.png'}

            />

            <Simpson
                heroName={'Мэгги Симпсон'}
                biography={'Мэгги родилась не в Спрингфилде, однако жила в Спрингфилде – её можно заметить ' +
                    'пробегающую мимо дежурного по коридору Клэнси Виггама. Закончив она, возможно, переехала в ' +
                    'другой город со своим мужем – она неоднократно его упоминала в разговорах, однако позже Мэгги ' +
                    'вернулась обратно в Спрингфилд, когда её муж начал изменять ей с их семейным психологом, ' +
                    'так что можно предположить, что у них и до этого были проблемы в браке...'}
                image={'https://static.wikia.nocookie.net/simpsons/images/7/7f/Maggie_Simpson_Tapped_Out.png'}

            />

            <Simpson
                heroName={'Абрахам Симпсон II'}
                biography={'Абрахам Джей Симпсон родился в семье Орвилла Симпсона и Юмы Хикмен. Когда его семья ' +
                    'иммигрировала в США, первое время они жили внутри головы Статуи Свободы, во всяком случае так об ' +
                    'этом рассказывает он сам (23 серия 7 сезона). Затем Эйб жил в Олбани, штат Нью-Йорк, где, как он ' +
                    'говорит, его признали «самым симпатичным парнем». Во время Первой мировой войны он вступил в Армию ' +
                    'США, солгав о своём возрасте.'}
                image={'https://static.wikia.nocookie.net/simpsons/images/c/c5/Abraham_Simpson_-_shading.png'}

            />
        </div>
    );
};

export default Simpsons;